{
    "edge": {
        "title": "Microsoft Edge",
        "logo": "./edge.png",
        "description": "Microsoft Edge is the default web browser on Windows 10, Windows 10 Mobile, Windows 11, Xbox One, and Xbox Series X and Series S consoles, replacing Internet Explorer 11 and Internet Explorer Mobile. As its development and release is dependent on the model of Windows as a service, it is not included in Windows 10 Enterprise Long-Term Servicing Channel (LTSC) builds. Microsoft initially announced that Edge would support the legacy MSHTML (Trident) browser engine for backwards compatibility, but later said that, due to 'strong feedback,' Edge would use a new engine, while Internet Explorer would continue to provide the legacy engine.",
        "homepage": "https://www.microsoft.com/edge"
    },
    "firefox": {
        "title": "Mozilla Firefox",
        "logo": "./firefox.png",
        "description": "Mozilla Firefox, or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. It uses the Gecko rendering engine to display web pages, which implements current and anticipated web standards. In 2017, Firefox began incorporating new technology under the code name Quantum to promote parallelism and a more intuitive user interface. Firefox is available for Windows 7 and later versions, macOS, and Linux. Its unofficial ports are available for various Unix and Unix-like operating systems, including FreeBSD, OpenBSD, NetBSD, illumos, and Solaris Unix. It is also available for Android and iOS. However, the iOS version uses the WebKit layout engine instead of Gecko due to platform requirements, as with all other iOS web browsers. An optimized version is also available on the Amazon Fire TV, as one of the two main browsers available with Amazon's Silk Browser.",
        "homepage": "https://www.mozilla.org/en-US/firefox/new/"
    },
    "opera": {
        "title": "Opera",
        "logo": "./opera.png",
        "description": " ",
        "homepage": "https://www.opera.com/browsers/opera"
    }
}